Blazemeter/DemoTest-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: DemoTest-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: DemoTest-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  DemoTest-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(chrome://newtab/)
      - go(https://www.google.com/)
      - clickByName(q)
      - typeByName(q): "Selenium Test"
      - keysByName(q): KEY_ENTER

  DemoTest-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.108 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://www.google.com/'
            method: GET
            label: 'https://www.google.com/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Sec-Fetch-User: '?1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: S
              cp: '1'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Se
              cp: '2'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Sel
              cp: '3'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Sele
              cp: '4'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Selen
              cp: '5'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Seleni
              cp: '6'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Seleniu
              cp: '7'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Selenium
              cp: '8'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: 'Selenium '
              cp: '9'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Selenium T
              cp: '10'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Selenium Te
              cp: '11'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Selenium Tes
              cp: '12'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: Selenium Test
              cp: '13'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              psi: oeTnXcPgN7WI4-EPqOecoAM.1575478435538
              ei: oeTnXcPgN7WI4-EPqOecoAM
          - url: 'https://www.google.com/search'
            method: GET
            label: 'https://www.google.com/search'
            think-time: 239ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Sec-Fetch-User: '?1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              sxsrf: 'ACYBGNQr5G_XI_RMhEusUD5J81ylxKKVLQ:1575478433973'
              source: hp
              ei: oeTnXcPgN7WI4-EPqOecoAM
              q: Selenium Test
              oq: Selenium Test
              gs_l: psy-ab.3..0l10.2929.7886..8087...2.0..0.201.1183.11j1j1......0....1..gws-wiz.....5..35i362i39j35i39j0i131.EY8Gssz9C1M
              ved: 0ahUKEwiDtZ7DupzmAhU1xDgGHagzBzQQ4dUDCAY
              uact: '5'
          - url: 'https://www.google.com/complete/search'
            method: GET
            label: 'https://www.google.com/complete/search'
            headers:
              Accept: '*/*'
            body:
              q: ''
              cp: '0'
              client: psy-ab
              xssi: t
              gs_ri: gws-wiz
              hl: en-IN
              authuser: '0'
              pq: Selenium Test
              psi: q-TnXe-TKIGd4-EPzuqb8Ao.1575478445016
              ei: q-TnXe-TKIGd4-EPzuqb8Ao
          - url: 'https://www.google.com/async/bgasy'
            method: GET
            label: 'https://www.google.com/async/bgasy'
            headers:
              Accept: '*/*'
            body:
              ei: q-TnXe-TKIGd4-EPzuqb8Ao
              yv: '3'
              async: '_fmt:jspb'
          - url: 'https://www.google.com/async/ugc_ms_ss'
            method: GET
            label: 'https://www.google.com/async/ugc_ms_ss'
            headers:
              Accept: '*/*'
            body:
              ei: q-TnXe-TKIGd4-EPzuqb8Ao
              yv: '3'
              async: 'num_questions:10,question1:UgzGbZEb40SCOXPSxVt4AaABGg,question2:UgzntLBj8d_mHsy5jq54AaABGg,question3:UgwWqRUMAcw4YP9P6DB4AaABGg,question4:UgzBGpmV6KJo-ucQbxt4AaABGg,question5:UgxtNZ79IObNFzrUjU94AaABGg,question6:UgwrkfRpxLnZKUz2PgF4AaABGg,question7:UgwE0Bk9TIE8FukTEUZ4AaABGg,question8:UgzZBsJW7jLGS0qFNPt4AaABGg,question9:Ugxdm1kWMiEeiBA-awt4AaABGg,question10:UgzgABDOEziBve4DpvN4AaABGg,_fmt:jspb'
          - url: 'https://www.google.com/async/ecr'
            method: GET
            label: 'https://www.google.com/async/ecr'
            headers:
              Accept: '*/*'
            body:
              ei: q-TnXe-TKIGd4-EPzuqb8Ao
              lei: q-TnXe-TKIGd4-EPzuqb8Ao
              yv: '3'
              async: 'encoded_cache_key:ChMIr5Xxx7qc5gIVgc44Bh1O9QauEgIYAQ,version_info:MyAz4fY4Hv4bgFuoIW2sidt4F1Qd7RY,attempt:1,_fmt:jspb'